In [49]:
import psycopg2
import pandas as pd

def run(query):
    conn = psycopg2.connect(database = 'diskusi_kel4', user = "postgres", password = 'maftuh2003', host = "localhost", port = "5432")
    cur = conn.cursor()
#     cur.execute(query)
#     return cur.fetchall()
    return pd.read_sql(query, conn)

# No 1

In [52]:
query = "SELECT * FROM _offices ORDER BY country, state, city;"
run(query)

,officecode,city,phone,addressline1,addressline2,state,country,postalcode,territory
0,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
1,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA
2,5,Tokyo,+81 33 224 5000,4-1 Kioicho,,Chiyoda-Ku,Japan,102-8578,Japan
3,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,,UK,EC2N 1HN,EMEA
4,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
5,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
6,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA

# NO 2

In [55]:
query = "SELECT COUNT(employeenumber) FROM _employees"
run(query)

   count
0     23